infakestor_app/app/controllers/stocks_controller.rb

SELECT  "stocks".* FROM "stocks" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "stocks"
---
  def index
     @stocks = Stock.paginate(page: params[:page])

SELECT  "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
---
    def show
   @stock = Stock.find(params[:id])